benchmark/results/20260610_191243/read_committed_c50_j8.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 8
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 70191
number of failed transactions: 0 (0.000%)
latency average = 7.046 ms
initial connection time = 130.343 ms
tps = 7096.172954 (without initial connection time)