benchmark/results/20260610_191243/serializable_c100_j8.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload_serializable.sql
scaling factor: 1
query mode: simple
number of clients: 100
number of threads: 8
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 49799
number of failed transactions: 0 (0.000%)
latency average = 19.639 ms
initial connection time = 270.379 ms
tps = 5091.943116 (without initial connection time)